Revit 2026 API

# CurveUVCreate Method

---

Create a CurveUV from a bounded 3D Curve lying in the XY plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static CurveUV Create(
	Curve curve3D
)
```
```vb
Public Shared Function Create (
	curve3D As Curve
) As CurveUV
```
```cpp
public:
static CurveUV^ Create(
	Curve^ curve3D
)
```
```fsharp
static member Create :
        curve3D : Curve -> CurveUV
```

#### Parameters

curve3D Curve
     The input bounded 3D Curve lying in the XY plane (i.e., z = 0 everywhere along the curve).

#### Return Value

CurveUV The newly created CurveUV.

| Exception | Condition |
| --- | --- |
| ArgumentException | The input Curve is not a bounded 3D Curve lying in the XY plane (i.e., z = 0 everywhere along the curve). |
| ArgumentNullException | A non-optional argument was null |

The XY plane is identified with the uv parameter space of the surface to which this SurfParamSpaceCurve refers.

#### Reference

CurveUV Class

Autodesk.Revit.DB Namespace